Amiya200/stm32_water_tank/Core/Src/model_handle.c
    return false;
}

static void auto_tick(void)
{
    if (!autoActive)
        return;

    uint32_t now = now_ms();
    uint8_t  level = get_tank_level_percent();

    bool levelLow  = (level <= AUTO_START_LEVEL_PERCENT);
    bool levelFull = (level >= 100);

    bool protectionFault =
        senseOverLoad ||
        senseUnderLoad ||
        senseOverUnderVolt ||
        senseMaxRunReached;

    /* ==========================================================
       HARD STOP CONDITIONS (Immediate Stop + Exit Auto)
    ========================================================== */
    if (levelFull || protectionFault)
    {
        stop_motor();
        autoState = AUTO_IDLE;
        auto_retry_count = 0;
        return;
    }

    switch (autoState)
    {
        /* ======================================================
           AUTO_IDLE
        ====================================================== */
        case AUTO_IDLE:
        {
            if (levelLow && groundWater)
            {
                motorOwner = MOTOR_OWNER_AUTO;
                start_motor();

                autoDeadline = now + (uint32_t)auto_gap_s * 1000UL;
                autoState = AUTO_ON_WAIT;
            }
        }
        break;

        /* ======================================================
           AUTO_ON_WAIT (Motor ON)
        ====================================================== */
        case AUTO_ON_WAIT:
        {

            /* Keep motor ON */
            motorOwner = MOTOR_OWNER_AUTO;
            if (!Motor_GetStatus())
                start_motor();

            /* Dry run check during ON phase */
            if (!senseDryRun || !groundWater)
            {
                stop_motor();
                auto_retry_count++;

                autoDeadline = now + (uint32_t)auto_gap_s * 1000UL;
                autoState = AUTO_OFF_WAIT;
                break;
            }

            /* Wait full ON gap */
            if ((int32_t)(now - autoDeadline) >= 0)
            {
                /* Continue next ON cycle if still needed */
                if (levelLow && groundWater)
                {
                    autoDeadline = now + (uint32_t)auto_gap_s * 1000UL;
                }
                else
                {
                    stop_motor();
                    autoState = AUTO_IDLE;
                }
            }
        }
        break;

        /* ======================================================
           AUTO_OFF_WAIT (Motor OFF)
        ====================================================== */
        case AUTO_OFF_WAIT:
        {
            /* Motor stays OFF */
            stop_motor();

            /* Wait full OFF gap */
            if ((int32_t)(now - autoDeadline) >= 0)
            {
                if (levelLow && groundWater)
                {
                    motorOwner = MOTOR_OWNER_AUTO;
                    start_motor();

                    autoDeadline = now + (uint32_t)auto_gap_s * 1000UL;
                    autoState = AUTO_ON_WAIT;
                }
                else
                {
                    autoState = AUTO_IDLE;
                }
            }
        }
        break;

        default:
            autoState = AUTO_IDLE;
        break;
    }
}

void ModelHandle_StartCountdown(uint32_t seconds)
{
    if (seconds == 0)
        return;

    clear_all_modes();

    countdownActive   = true;
    countdownMode     = true;
    countdownDuration = seconds;
    cd_deadline       = now_ms() + seconds * 1000UL;

    motorOwner = MOTOR_OWNER_COUNTDOWN;
    start_motor();

    ModelHandle_SaveModeState();
}

void ModelHandle_StopCountdown(void)
{
    countdownActive = false;
    countdownMode   = false;
    countdownDuration = 0;
    SaveCountdown();
    stop_motor();
    ModelHandle_SaveModeState();
}
static void countdown_tick(void)
{
    if (!countdownActive)
        return;

    uint32_t now = now_ms();

    if (isTankFull() ||
        senseOverLoad ||
        senseUnderLoad ||
        senseOverUnderVolt ||
        senseMaxRunReached)
    {
        ModelHandle_StopCountdown();
        Buzzer_TriggerAlert();
        return;
    }

    if (now >= cd_deadline)
    {
        ModelHandle_StopCountdown();
        return;
    }

    countdownDuration = (cd_deadline - now) / 1000UL;
}
static uint16_t CD_CRC(const uint8_t* d,uint16_t l){
    uint16_t c=0xFFFF;
    while(l--) c=(c>>1)^(*d++ + 0xA001);
    return c;
}
static void SaveCountdown(void)
{
    CountdownBlock b;
    b.sig = CD_SIGNATURE;
    b.remaining = countdownDuration;
    b.active = countdownActive;
    b.crc = CD_CRC((uint8_t*)&b,sizeof(b)-2);

    EEPROM_WriteBuffer(EE_ADDR_COUNTDOWN_BLOCK,(uint8_t*)&b,sizeof(b));
}
void ModelHandle_LoadCountdown(void)
{
    CountdownBlock b;
    EEPROM_ReadBuffer(EE_ADDR_COUNTDOWN_BLOCK,(uint8_t*)&b,sizeof(b));
    if(b.sig!=CD_SIGNATURE) return;
    if(CD_CRC((uint8_t*)&b,sizeof(b)-2)!=b.crc) return;
    if(b.active && b.remaining > 0)
    {
        countdownActive   = true;
        countdownMode     = true;
        countdownDuration = b.remaining;
        cd_deadline = now_ms() + b.remaining * 1000UL;   // <<< FIX
        start_motor();
    }
}
void ModelHandle_StartTwist(uint16_t on_s, uint16_t off_s,
                            uint8_t onH, uint8_t onM,
                            uint8_t offH, uint8_t offM)
{
    clear_all_modes();
    uint32_t on_sec  = (on_s  ? on_s  : 1) * 60UL;
    uint32_t off_sec = (off_s ? off_s : 1) * 60UL;
    twistSettings.onDurationSeconds  = on_sec;
    twistSettings.offDurationSeconds = off_sec;
    twistSettings.onHour = onH;
    twistSettings.onMinute = onM;
    twistSettings.offHour = offH;
    twistSettings.offMinute = offM;
    twistSettings.twistArmed = true;
    twistSettings.twistActive = false;
    twist_on_phase = true;
    twist_deadline = now_ms() + on_sec * 1000UL;
    start_motor();
}
void ModelHandle_StopTwist(void)
{
    twistActive = false;
    twistSettings.twistActive = false;
    stop_motor();
    ModelHandle_SaveModeState();
}
static void twist_time_logic(void)
{
    if (!twistSettings.twistArmed) return;
    if (!twistActive &&
        time.hour == twistSettings.onHour &&
        time.min  == twistSettings.onMinute)
    {
        twistActive = true;
        twistSettings.twistActive = true;
        twist_on_phase = true;
        twist_deadline = now_ms() +
                         twistSettings.onDurationSeconds * 1000UL;
        start_motor();
    }
    if (twistActive &&
        time.hour == twistSettings.offHour &&
        time.min  == twistSettings.offMinute)
    {
        ModelHandle_StopTwist();
    }
}
static void twist_tick(void)
{
	if (!twistActive) return;
	    if (isTankFull())
	    {
	        ModelHandle_StopTwist();
	        Buzzer_TriggerAlert();
	        return;
	    }
    uint32_t now = now_ms();
    if (now >= twist_deadline)
    {
        twist_on_phase = !twist_on_phase;
        twist_deadline = now +
            (twist_on_phase ? twistSettings.onDurationSeconds
                            : twistSettings.offDurationSeconds) * 1000UL;
    }
    if (twist_on_phase) start_motor();
    else stop_motor();
}
static void protections_tick(void)
{
    if (senseMaxRunReached)
        stop_motor();
}
static void leds_from_model(void)
{
    LED_ClearAllIntents();
    bool motorOn = Motor_GetStatus();
    if (motorOn)
        LED_SetIntent(LED_COLOR_GREEN, LED_MODE_STEADY, 0);
    if (!senseDryRun)
    {
        if (motorOn)
            LED_SetIntent(LED_COLOR_GREEN, LED_MODE_BLINK, 350);
        else
            LED_SetIntent(LED_COLOR_RED, LED_MODE_STEADY, 0);
    }
    if (senseMaxRunReached)
        LED_SetIntent(LED_COLOR_RED, LED_MODE_BLINK, 300);
    if (senseOverLoad || senseUnderLoad)
        LED_SetIntent(LED_COLOR_BLUE, LED_MODE_BLINK, 350);
    if (senseOverUnderVolt)
        LED_SetIntent(LED_COLOR_PURPLE, LED_MODE_BLINK, 350);
    LED_ApplyIntents();
}
void ModelHandle_Process(void)
{
    uint32_t now = HAL_GetTick();

